{
  "experiences": [
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D4E0BAQEWAscBIPhVtA/company-logo_200_200/company-logo_200_200/0/1699579943825?e=1762387200&v=beta&t=-cOWEDqF-8hRelndXwDOoTv8RxtxT0kBu62OwPbfJ9g",
      "role": "AI Research & Development (PhD Supervised)",
      "companyName": "Monash Assistive Tech Team",
      "location": "Clayton, VIC",
      "startDate": "August 2025",
      "endDate": "Present",
      "description": [
        "A student-led team designing open-source hardware and software that supports the daily lives of people with disabilities with community, care and creativity.",
        "Working with a team of students, being led by PhD candidate Benjamin Phua from the Monash Emodied Visualisation group. Reviewing AI research papers and academic literature on machine learning approaches for emotional intelligence and communication patterns, translating theoretical concepts into practical implementation.",
        "Experimenting responsible AI systems for vulnerable communities, implementing rigorous safety measures and ethical guardrails. Following new found evaluation methodologies to ensure we follow the best practices to build comprehensive evaluation pipelines, including automated testing, AI as a judge patterns, and human-in-the-loop validation.",
        "Building an AI application using Python and FastAPI for the backend with an agentic pipeline using LangChain+LangGraph, and LangSmith for observability.",
        "Created emoji similarity search with embeddings using PyTorch and Sentence Transfomers."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/C560BAQFsk2EB69l49w/company-logo_200_200/company-logo_200_200/0/1678526247676?e=1762387200&v=beta&t=r7BaRXM59xXX0GqJRthu-1U8ewq7kdBvTO7SXRRIWqs",
      "role": "Student Software Engineer",
      "companyName": "Monash Connected Autonomous Vehicle",
      "location": "Clayton, VIC",
      "startDate": "August 2025",
      "endDate": "Present",
      "description": [
        "MCAV is a premiere engineering student team developing autonomous vehicle and intelligent transport technologies, from Monash University.",
        "My role is within the Urban Autonomy team, working with software and hardware R&D to achieve SAE Level 4 autonomy with MCAV's StreetDrone Renault Twizy vehicle.",
        "Starting my final year project partnered with this student team, making use of ROS2 simulations to create an autonomous ride-sharing mobile application built using React Native and a Rust backend with a Kafka data collection pipeline to continuously improve autonomy."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D560BAQFtcDSYOtA4XA/company-logo_200_200/B56ZgOB2dYHsAM-/0/1752582023381/wired_monash_logo?e=1762387200&v=beta&t=fIrYSJcdMaN4sb6rtsoNCTuNUQOdDuxeP3hpHVmk8lA",
      "role": "Project Lead",
      "companyName": "Faculty of Information Technology Society (WIRED Monash)",
      "location": "Clayton, VIC",
      "startDate": "May 2024",
      "endDate": "June 2025",
      "description": [
        "Led the development of MonSTAR which directly benefited the student community at my university.",
        "Mentored team members with full-stack development with a primary goal of creating a productive and inclusive team environment.",
        "Oversaw project timelines using Jira, defining & monitoring issues, epics, and sprint goals."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/C510BAQE5WFsvU5iicw/company-logo_200_200/company-logo_200_200/0/1631310285230?e=1762387200&v=beta&t=m1RZ8PBHYevZ3_zarS09ne6en_ncTZjQFjHf8879YBk",
      "role": "Monash Innovation Guarantee",
      "companyName": "UNICEF/Hashcode",
      "location": "Docklands, VIC",
      "startDate": "January 2025",
      "endDate": "Present",
      "description": [
        "Took part in the 3-week innovation sprint offered by Monash University to conceptualise and pitch a secure SaaS architecture for UNICEF's uSupport platform. Awarded with a HD final grade."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D4E0BAQGyUKaYgsO3cg/company-logo_200_200/B4EZb.zwGgGQAI-/0/1748031701722/youtube_logo?e=1762387200&v=beta&t=kQGXZ_lh1rRZYxJ5nzXx2wurefP8MKzU-kNTocIJ_pI",
      "role": "Computer Science YouTube Channel",
      "companyName": "@ferdinandcoding",
      "location": "Online",
      "startDate": "July 2023",
      "endDate": "October 2024",
      "description": [
        "Produced educational videos on algorithms, data structures, and theoretical CS.",
        "Grew channel to over 700 subscribers and accumulated a total of 500K+ views.",
        "Simplified Computer Science topics for a broad audience via short form and long form content."
      ]
    }
  ]
}