{
  "experiences": [
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Software Engineer",
      "companyName": "Monash Connected Autonomous Vehicle (student team)",
      "location": "Clayton, VIC",
      "startDate": "August 2025",
      "endDate": "Present",
      "description": [
        "Final year project, a SIL simulation framework bridging the ROS 2 autonomy stack with a ride-hailing app.",
        "Designed a concurrent Rust backend architecture for real-time vehicle telemetry ingestion using WebSockets.",
        "Engineered ROS to HTTP bridges to translate Autoware topics into external JSON endpoints.",
        "Authored the technical proposal and feasibility analysis, utilising the Spiral Model to mitigate integration risks.",
        "Designing a data pipeline, utilising Apache Kafka for ingestion of vehicle route performance and emissions data."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "AI Engineer",
      "companyName": "Monash Assistive Tech Team (student team)",
      "location": "Clayton, VIC",
      "startDate": "August 2025",
      "endDate": "Present",
      "description": [
        "Collaborated on PhD-led research into responsible conversational AI to support individuals with disabilities.",
        "Evaluated ML approaches and papers for emotional intelligence and communication pattern recognition.",
        "Built an agentic AI application using Python, FastAPI, LangChain, and LangGraph.",
        "Experimented with emoji similarity search using PyTorch embeddings and sentence transformers.",
        "Implemented AI as a Judge evaluation patterns to benchmark model performance."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Project Lead",
      "companyName": "Faculty of Information Technology Society (student society)",
      "location": "Clayton, VIC",
      "startDate": "May 2024",
      "endDate": "June 2025",
      "description": [
        "Led a team of 8 students to build projects that benefit the student community at Monash University.",
        "Mentored colleagues in full-stack and project maintainance best practices for version control and pull requests.",
        "Facilitated a productive and inclusive team environment, prioritising time management to fit the busy uni schedule.",
        "Oversaw project timelines using Jira, defining & monitoring issues, epics, and sprint goals."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Solutions Architect Intern",
      "companyName": "UNICEF (MIG 2025)",
      "location": "Docklands, VIC",
      "startDate": "January 2025",
      "endDate": "Present",
      "description": [
        "Designed a secure SaaS architecture for UNICEF's uSupport platform to integrate third-party services.",
        "Modeled API integration flows to enable secure data exchange between external apps and the core platform.",
        "Presented the technical roadmap to stakeholders, awarded with a High Distinction for the solution's feasibility."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Computer Science YouTube Channel",
      "companyName": "@ferdinandcoding",
      "location": "Online",
      "startDate": "July 2023",
      "endDate": "October 2024",
      "description": [
        "Produced educational videos on algorithms, data structures, and theoretical computer science.",
        "Grew the channel to over 700 subscribers and accumulated a total of 500K+ views.",
        "Simplified computer science topics for a broad audience via short form and long form content."
      ]
    }
  ]
}