{
  "experiences": [
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D560BAQGo3DeZ0nd37Q/company-logo_200_200/company-logo_200_200/0/1684133720120/hawthorn_football_club_logo?e=1762387200&v=beta&t=w-dntFhl4H4z5Ubc8vdNOX_5sbvfp1xPC-xfsD3AeQ0",
      "role": "Computer Science Intern",
      "companyName": "Hawthorn Football Club",
      "location": "Mulgrave, VIC",
      "startDate": "August 2025",
      "endDate": "October 2025",
      "description": [
        "Mentored by the tech and data GM, tasked to build a workflow optimisation project to assist the coaching staff.",
        "Enterprise AI integration using Google Agentspace within GCP to facilitate data analysis for AFL coaching staff.",
        "Implemented tabular RAG for transactional AFL data offered by ChampionData hosted on Snowflake Cloud.",
        "Integrated tailored AI agents and ML models using the Google Agent Development Kit (ADK) and Vertex AI.",
        "Developed a one-shot prompt data analysis workflow built using Claude Code subagents.",
        "Delivered a presentation on prompt engineering for coaches outlining how to prompt LLMs effectively."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D4D0BAQHXAE5TTxyBuw/company-logo_200_200/B4DZiDuFcmGQAQ-/0/1754556553532/plandidau_logo?e=1762387200&v=beta&t=vkxwzZ_I9hYX1mW1bo2h4xi0hVdplymR9LpDbFm3Vd0",
      "role": "Software Engineer",
      "companyName": "Plandid",
      "location": "Remote, VIC",
      "startDate": "July 2025",
      "endDate": "Present",
      "description": [
        "Developed the backend using Python, FastAPI, Pydantic, and SQLAlchemy for Plandid's customer mobile app and vendor dashboard. Built for couples seeking wedding photographers, videographers, and content creators.",
        "Designed an optimised PostgreSQL database schema with 36 relational tables, implementing proper indexing strategies and query optimisation techniques that reduced average query time by 40%.",
        "Prioritised clear separation of concerns, modularisation, and scalability with a well thought out architecture.",
        "Implemented seamless calendar sync using Google Calendar API, storing encrypted user calendar data securely in the database with CSRF protection using synchronised tokens.",
        "Fetching and storing Google reviews for vendors using the Google Places API and also allowing customers to write reviews within the application."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Programming Tutor & Automation Developer",
      "companyName": "Digimaker",
      "location": "Eastern Suburbs, VIC",
      "startDate": "October 2024",
      "endDate": "Present",
      "description": [
        "Teaching weekly Python, Java, C & JavaScript classes to primary school students across 8 different schools, achieving an average 90% in-class completion rate for my students.",
        "Used supplied lesson sheets to break down core programming concepts, allowing students to independently complete each coding challenge.",
        "Schools: Leibler Yavneh College, McKinnon PS, Ruskin Park PS, Mulgrave PS, Burwood East PS, Greythorn PS ...",
        "Developed a student report generation automation using JavaScript on Google Apps Script.",
        "Utilised clasp and the glcoud CLI tool for local development with git for version control.",
        "Setup Github Actions for CI/CD, with automated testing using Jest for improved maintainance and less errors."
      ]
    }
  ]
}