{
  "experiences": [
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D560BAQGo3DeZ0nd37Q/company-logo_200_200/company-logo_200_200/0/1684133720120/hawthorn_football_club_logo?e=1762387200&v=beta&t=w-dntFhl4H4z5Ubc8vdNOX_5sbvfp1xPC-xfsD3AeQ0",
      "role": "Computer Science Intern",
      "companyName": "Hawthorn Football Club",
      "location": "Mulgrave, VIC",
      "startDate": "August 2025",
      "endDate": "October 2025",
      "description": [
        "Mentored by the tech and data GM, tasked to build a workflow optimisation project to assist the coaching staff.",
        "Enterprise AI integration using Google Agentspace within GCP to facilitate data analysis for AFL coaching staff.",
        "Implemented tabular RAG for transactional AFL data offered by ChampionData hosted on Snowflake Cloud.",
        "Integrated tailored AI agents and ML models using the Google Agent Development Kit (ADK) and Vertex AI.",
        "Delivered a presentation on prompt engineering for coaches outlining how to prompt LLMs effectively.",
        "Developed a one-shot data analysis workflow for the data analysts built using Claude Code subagents."
      ]
    },
    {
      "companyImage": "https://media.licdn.com/dms/image/v2/D4D0BAQHXAE5TTxyBuw/company-logo_200_200/B4DZiDuFcmGQAQ-/0/1754556553532/plandidau_logo?e=1762387200&v=beta&t=vkxwzZ_I9hYX1mW1bo2h4xi0hVdplymR9LpDbFm3Vd0",
      "role": "Software Engineer",
      "companyName": "Plandid",
      "location": "Remote, VIC",
      "startDate": "July 2025",
      "endDate": "Present",
      "description": [
        "Developed the backend using Python, FastAPI, Pydantic, and SQLAlchemy, exposing APIs to the frontend.",
        "Designed a 40-table PostgreSQL schema with optimised indexes reducing query time by 40%.",
        "Architected with Domain Driven Design (DDD) ensuring strict separation of concerns and scalability.",
        "Incorporated caching using Redis alongside vertical scaling to improve serverless performance.",
        "Implemented secure Google Calendar sync with encrypted storage and CSRF protection.",
        "Integrated Google Places API to aggregate external reviews alongside internal user reviews."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Automation Developer",
      "companyName": "Digimaker",
      "location": "Eastern Suburbs, VIC",
      "startDate": "March 2025",
      "endDate": "June 2025",
      "description": [
        "Identified a bottleneck in the student reporting process and engineered an automation to generate PDF reports.",
        "Wrote JavaScript code in the Google Apps Script environment for a zero-cost student reporting solution.",
        "Optimised script execution flow to handle high-volume batch processing within the strict execution time limits.",
        "Deployed a web interface allowing non-technical admins to trigger report generation and manage student data.",
        "Implemented CI/CD using Github Actions, utilising clasp and git for local development and version control.",
        "Wrote unit tests using Jest for an automated test suite that runs before deployment in production."
      ]
    },
    {
      "companyImage": "https://placehold.co/48x48",
      "role": "Programming Tutor",
      "companyName": "Digimaker",
      "location": "Eastern Suburbs, VIC",
      "startDate": "October 2024",
      "endDate": "Present",
      "description": [
        "Teaching weekly Python, Java, C & JavaScript classes to primary school students across 8 different schools, achieving an average 90% in-class completion rate for my students.",
        "Used supplied lesson sheets to break down core coding concepts, allowing students to independently learn.",
        "Provided patient coding guidance to students when debugging, quickly identifying logic errors and bugs.",
        "Schools: Leibler Yavneh College, McKinnon PS, Ruskin Park PS, Mulgrave PS, Burwood East PS, Greythorn PS ..."
      ]
    }
  ]
}